URLShortener/app/models/shortened_url.rb

SELECT  1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "lIzfea9WT9eJzD4Sza1Www"], ["LIMIT", 1]]
---
    def self.random_code
        code = SecureRandom.urlsafe_base64(16)
        self.exists?(short_url: code) ? ShortenedUrl.random_code : code