URLShortener/app/models/visit.rb

INSERT INTO "visits" ("user_id", "shortened_url_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["shortened_url_id", 1], ["created_at", "2020-08-06 21:26:32.829624"], ["updated_at", "2020-08-06 21:26:32.829624"]]
---
    def self.record_visit!(user, shortened_url)
        Visit.create(user_id: user.id, shortened_url_id: shortened_url.id).save